#include <stdio.h>
//
// Created by Administrator on 2026/6/29.
//
/**
* 190. 颠倒二进制位
简单
相关标签
premium lock icon
相关企业
颠倒给定的 32 位有符号整数的二进制位。



示例 1：

输入：n = 43261596

输出：964176192

解释：

整数	二进制
43261596	00000010100101000001111010011100
964176192	00111001011110000010100101000000
示例 2：

输入：n = 2147483644

输出：1073741822

解释：

整数	二进制
2147483644	01111111111111111111111111111100
1073741822	00111111111111111111111111111110


提示：

0 <= n <= 231 - 2
n 为偶数


进阶: 如果多次调用这个函数，你将如何优化你的算法？
 * @return
 */
//直接在整数0基础上，查看n的1~30位的值是0还是1，然后第1位的值放到0的第30位，第2位的值放到第29位，第3位的值放到第28位...
int reverseBits(int n) {
    int ret = 0, i = 0;
    for (; n && i < 31; i++) {
        n >>= 1;
        ret = (ret << 1) | (n & 1);
    }
    //i<31说明还有31-i位个高位0没有结算，令ret往左移动这么些位数即可
    if (i < 31)
        ret <<= (31 - i);
    return ret;
}

int main() {
    int n = 2;
    printf("%d\n", reverseBits(n));
    return 0;
}
